<?xml version="1.0" ?>
<net batch="1" name="ssd7_Keurig-labels2" version="5">
	<layers>
		<layer id="0" name="input_1" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>360</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input_stddev_normalization/truediv/mul_/Fused_Mul_/FusedPower_" precision="FP32" type="Power">
			<data power="1" scale="0.00784313725490196" shift="-1.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>360</dim>
					<dim>480</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>360</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="conv1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="5,5" output="32" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>360</dim>
					<dim>480</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>480</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="9600"/>
				<biases offset="9600" size="128"/>
			</blobs>
		</layer>
		<layer id="3" name="elu1/Elu" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>480</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="pool1/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>480</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv2/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="48" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9728" size="55296"/>
				<biases offset="65024" size="192"/>
			</blobs>
		</layer>
		<layer id="6" name="elu2/Elu" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="pool2/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="conv3/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
			<blobs>
				<weights offset="65216" size="110592"/>
				<biases offset="175808" size="256"/>
			</blobs>
		</layer>
		<layer id="9" name="elu3/Elu" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="pool3/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="conv4/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<weights offset="176064" size="147456"/>
				<biases offset="323520" size="256"/>
			</blobs>
		</layer>
		<layer id="12" name="elu4/Elu" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="classes4/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="164" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>164</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<weights offset="323776" size="377856"/>
				<biases offset="701632" size="656"/>
			</blobs>
		</layer>
		<layer id="14" name="classes4/convolution/Permute_" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>164</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>45</dim>
					<dim>60</dim>
					<dim>164</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="classes4_reshape/Reshape/shape/Concat_/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="702288" size="12"/>
			</blobs>
		</layer>
		<layer id="16" name="classes4_reshape/Reshape" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>45</dim>
					<dim>60</dim>
					<dim>164</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>10800</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="pool4/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv5/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="48" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>22</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<weights offset="702300" size="110592"/>
				<biases offset="812892" size="192"/>
			</blobs>
		</layer>
		<layer id="19" name="elu5/Elu" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>22</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>22</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="classes5/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="164" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>22</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>164</dim>
					<dim>22</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<weights offset="813084" size="283392"/>
				<biases offset="1096476" size="656"/>
			</blobs>
		</layer>
		<layer id="21" name="classes5/convolution/Permute_" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>164</dim>
					<dim>22</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>22</dim>
					<dim>30</dim>
					<dim>164</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="classes5_reshape/Reshape/shape/Concat_/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="702288" size="12"/>
			</blobs>
		</layer>
		<layer id="23" name="classes5_reshape/Reshape" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>22</dim>
					<dim>30</dim>
					<dim>164</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>2640</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="pool5/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>22</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>11</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv6/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="48" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>11</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>11</dim>
					<dim>15</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1097132" size="82944"/>
				<biases offset="1180076" size="192"/>
			</blobs>
		</layer>
		<layer id="26" name="elu6/Elu" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>11</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>11</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="classes6/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="164" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>11</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>164</dim>
					<dim>11</dim>
					<dim>15</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1180268" size="283392"/>
				<biases offset="1463660" size="656"/>
			</blobs>
		</layer>
		<layer id="28" name="classes6/convolution/Permute_" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>164</dim>
					<dim>11</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>11</dim>
					<dim>15</dim>
					<dim>164</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="classes6_reshape/Reshape/shape/Concat_/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="702288" size="12"/>
			</blobs>
		</layer>
		<layer id="30" name="classes6_reshape/Reshape" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>11</dim>
					<dim>15</dim>
					<dim>164</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>660</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="pool6/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>11</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="conv7/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>5</dim>
					<dim>7</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1464316" size="55296"/>
				<biases offset="1519612" size="128"/>
			</blobs>
		</layer>
		<layer id="33" name="elu7/Elu" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>5</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>5</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="classes7/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="164" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>5</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>164</dim>
					<dim>5</dim>
					<dim>7</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1519740" size="188928"/>
				<biases offset="1708668" size="656"/>
			</blobs>
		</layer>
		<layer id="35" name="classes7/convolution/Permute_" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>164</dim>
					<dim>5</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>5</dim>
					<dim>7</dim>
					<dim>164</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="classes7_reshape/Reshape/shape/Concat_/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="702288" size="12"/>
			</blobs>
		</layer>
		<layer id="37" name="classes7_reshape/Reshape" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>7</dim>
					<dim>164</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>140</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="classes_concat/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10800</dim>
					<dim>41</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>2640</dim>
					<dim>41</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>660</dim>
					<dim>41</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>140</dim>
					<dim>41</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="classes_softmax/Max/Reshape/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1709324" size="16"/>
			</blobs>
		</layer>
		<layer id="40" name="classes_softmax/Max/Reshape" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>41</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>14240</dim>
					<dim>1</dim>
					<dim>41</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="classes_softmax/Max/Pool" precision="FP32" type="Pooling">
			<data exclude-pad="false" kernel="41,1" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="1,1"/>
			<input>
				<port id="0">
					<dim>14240</dim>
					<dim>1</dim>
					<dim>41</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>14240</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="classes_softmax/Max/FinalReshape/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1709340" size="12"/>
			</blobs>
		</layer>
		<layer id="43" name="classes_softmax/Max/FinalReshape" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>14240</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="classes_softmax/sub/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="classes_softmax/sub/add_/Broadcast/Reshape/Before" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="classes_softmax/sub/add_/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="41"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>41</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="classes_softmax/sub/add_/Broadcast/Reshape/After" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>41</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="classes_softmax/sub/add_" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>41</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>41</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="classes_softmax/Exp" precision="FP32" type="Activation">
			<data type="exp"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>41</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="classes_softmax/Sum/Reshape/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1709324" size="16"/>
			</blobs>
		</layer>
		<layer id="51" name="classes_softmax/Sum/Reshape" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>41</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>14240</dim>
					<dim>1</dim>
					<dim>41</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="classes_softmax/Sum/Pool" precision="FP32" type="Pooling">
			<data exclude-pad="false" kernel="41,1" pads_begin="0,0" pads_end="0,0" pool-method="avg" strides="1,1"/>
			<input>
				<port id="0">
					<dim>14240</dim>
					<dim>1</dim>
					<dim>41</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>14240</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="classes_softmax/Sum/FinalReshape/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1709340" size="12"/>
			</blobs>
		</layer>
		<layer id="54" name="classes_softmax/Sum/FinalReshape" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>14240</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="classes_softmax/Sum/FinalReshapePower/After" precision="FP32" type="Power">
			<data power="1" scale="41.0" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="classes_softmax/truediv/reciprocal_" precision="FP32" type="Power">
			<data power="-1.0" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="classes_softmax/truediv/mul_/Broadcast/Reshape/Before" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="classes_softmax/truediv/mul_/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="41"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>41</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="classes_softmax/truediv/mul_/Broadcast/Reshape/After" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>41</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="classes_softmax/truediv/mul_" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>41</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>41</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="boxes4/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1709352" size="36864"/>
				<biases offset="1746216" size="64"/>
			</blobs>
		</layer>
		<layer id="62" name="boxes4/convolution/Permute_" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>45</dim>
					<dim>60</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="boxes4_reshape/Reshape/shape/Concat_/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1746280" size="12"/>
			</blobs>
		</layer>
		<layer id="64" name="boxes4_reshape/Reshape" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>45</dim>
					<dim>60</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>10800</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="boxes5/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>22</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>22</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1746292" size="27648"/>
				<biases offset="1773940" size="64"/>
			</blobs>
		</layer>
		<layer id="66" name="boxes5/convolution/Permute_" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>22</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>22</dim>
					<dim>30</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="boxes5_reshape/Reshape/shape/Concat_/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1746280" size="12"/>
			</blobs>
		</layer>
		<layer id="68" name="boxes5_reshape/Reshape" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>22</dim>
					<dim>30</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>2640</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="boxes6/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>11</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>11</dim>
					<dim>15</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1774004" size="27648"/>
				<biases offset="1801652" size="64"/>
			</blobs>
		</layer>
		<layer id="70" name="boxes6/convolution/Permute_" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>11</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>11</dim>
					<dim>15</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="boxes6_reshape/Reshape/shape/Concat_/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1746280" size="12"/>
			</blobs>
		</layer>
		<layer id="72" name="boxes6_reshape/Reshape" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>11</dim>
					<dim>15</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>660</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="boxes7/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>5</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>5</dim>
					<dim>7</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1801716" size="18432"/>
				<biases offset="1820148" size="64"/>
			</blobs>
		</layer>
		<layer id="74" name="boxes7/convolution/Permute_" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>5</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>5</dim>
					<dim>7</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="boxes7_reshape/Reshape/shape/Concat_/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1746280" size="12"/>
			</blobs>
		</layer>
		<layer id="76" name="boxes7_reshape/Reshape" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>7</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>140</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="boxes_concat/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10800</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>2640</dim>
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>660</dim>
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>140</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="anchors_concat/concat/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1820212" size="455680"/>
			</blobs>
		</layer>
		<layer id="79" name="predictions/concat" precision="FP32" type="Concat">
			<data axis="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>41</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>14240</dim>
					<dim>53</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="3" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="1" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="3" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0"/>
		<edge from-layer="8" from-port="3" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="1" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="11" to-port="0"/>
		<edge from-layer="11" from-port="3" to-layer="12" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="3" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="1" to-layer="16" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="16" to-port="1"/>
		<edge from-layer="12" from-port="1" to-layer="17" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="18" to-port="0"/>
		<edge from-layer="18" from-port="3" to-layer="19" to-port="0"/>
		<edge from-layer="19" from-port="1" to-layer="20" to-port="0"/>
		<edge from-layer="20" from-port="3" to-layer="21" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="23" to-port="0"/>
		<edge from-layer="22" from-port="1" to-layer="23" to-port="1"/>
		<edge from-layer="19" from-port="1" to-layer="24" to-port="0"/>
		<edge from-layer="24" from-port="1" to-layer="25" to-port="0"/>
		<edge from-layer="25" from-port="3" to-layer="26" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="27" to-port="0"/>
		<edge from-layer="27" from-port="3" to-layer="28" to-port="0"/>
		<edge from-layer="28" from-port="1" to-layer="30" to-port="0"/>
		<edge from-layer="29" from-port="1" to-layer="30" to-port="1"/>
		<edge from-layer="26" from-port="1" to-layer="31" to-port="0"/>
		<edge from-layer="31" from-port="1" to-layer="32" to-port="0"/>
		<edge from-layer="32" from-port="3" to-layer="33" to-port="0"/>
		<edge from-layer="33" from-port="1" to-layer="34" to-port="0"/>
		<edge from-layer="34" from-port="3" to-layer="35" to-port="0"/>
		<edge from-layer="35" from-port="1" to-layer="37" to-port="0"/>
		<edge from-layer="36" from-port="1" to-layer="37" to-port="1"/>
		<edge from-layer="16" from-port="2" to-layer="38" to-port="0"/>
		<edge from-layer="23" from-port="2" to-layer="38" to-port="1"/>
		<edge from-layer="30" from-port="2" to-layer="38" to-port="2"/>
		<edge from-layer="37" from-port="2" to-layer="38" to-port="3"/>
		<edge from-layer="38" from-port="4" to-layer="40" to-port="0"/>
		<edge from-layer="39" from-port="1" to-layer="40" to-port="1"/>
		<edge from-layer="40" from-port="2" to-layer="41" to-port="0"/>
		<edge from-layer="41" from-port="1" to-layer="43" to-port="0"/>
		<edge from-layer="42" from-port="1" to-layer="43" to-port="1"/>
		<edge from-layer="43" from-port="2" to-layer="44" to-port="0"/>
		<edge from-layer="44" from-port="1" to-layer="45" to-port="0"/>
		<edge from-layer="45" from-port="1" to-layer="46" to-port="0"/>
		<edge from-layer="46" from-port="1" to-layer="47" to-port="0"/>
		<edge from-layer="38" from-port="4" to-layer="48" to-port="0"/>
		<edge from-layer="47" from-port="1" to-layer="48" to-port="1"/>
		<edge from-layer="48" from-port="2" to-layer="49" to-port="0"/>
		<edge from-layer="49" from-port="1" to-layer="51" to-port="0"/>
		<edge from-layer="50" from-port="1" to-layer="51" to-port="1"/>
		<edge from-layer="51" from-port="2" to-layer="52" to-port="0"/>
		<edge from-layer="52" from-port="1" to-layer="54" to-port="0"/>
		<edge from-layer="53" from-port="1" to-layer="54" to-port="1"/>
		<edge from-layer="54" from-port="2" to-layer="55" to-port="0"/>
		<edge from-layer="55" from-port="1" to-layer="56" to-port="0"/>
		<edge from-layer="56" from-port="1" to-layer="57" to-port="0"/>
		<edge from-layer="57" from-port="1" to-layer="58" to-port="0"/>
		<edge from-layer="58" from-port="1" to-layer="59" to-port="0"/>
		<edge from-layer="59" from-port="1" to-layer="60" to-port="0"/>
		<edge from-layer="49" from-port="1" to-layer="60" to-port="1"/>
		<edge from-layer="12" from-port="1" to-layer="61" to-port="0"/>
		<edge from-layer="61" from-port="3" to-layer="62" to-port="0"/>
		<edge from-layer="62" from-port="1" to-layer="64" to-port="0"/>
		<edge from-layer="63" from-port="1" to-layer="64" to-port="1"/>
		<edge from-layer="19" from-port="1" to-layer="65" to-port="0"/>
		<edge from-layer="65" from-port="3" to-layer="66" to-port="0"/>
		<edge from-layer="66" from-port="1" to-layer="68" to-port="0"/>
		<edge from-layer="67" from-port="1" to-layer="68" to-port="1"/>
		<edge from-layer="26" from-port="1" to-layer="69" to-port="0"/>
		<edge from-layer="69" from-port="3" to-layer="70" to-port="0"/>
		<edge from-layer="70" from-port="1" to-layer="72" to-port="0"/>
		<edge from-layer="71" from-port="1" to-layer="72" to-port="1"/>
		<edge from-layer="33" from-port="1" to-layer="73" to-port="0"/>
		<edge from-layer="73" from-port="3" to-layer="74" to-port="0"/>
		<edge from-layer="74" from-port="1" to-layer="76" to-port="0"/>
		<edge from-layer="75" from-port="1" to-layer="76" to-port="1"/>
		<edge from-layer="64" from-port="2" to-layer="77" to-port="0"/>
		<edge from-layer="68" from-port="2" to-layer="77" to-port="1"/>
		<edge from-layer="72" from-port="2" to-layer="77" to-port="2"/>
		<edge from-layer="76" from-port="2" to-layer="77" to-port="3"/>
		<edge from-layer="60" from-port="2" to-layer="79" to-port="0"/>
		<edge from-layer="77" from-port="4" to-layer="79" to-port="1"/>
		<edge from-layer="78" from-port="1" to-layer="79" to-port="2"/>
	</edges>
	<meta_data>
		<MO_version value="2019.1.0-341-gc9b66a2"/>
		<cli_parameters>
			<data_type value="FP32"/>
			<disable_fusing value="False"/>
			<disable_gfusing value="False"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<generate_deprecated_IR_V2 value="False"/>
			<input_model value="DIR/ssd7_Keurig-labels2.pb"/>
			<input_model_is_text value="False"/>
			<input_shape value="(1,360,480,3)"/>
			<keep_shape_ops value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_shapes value="[  1 360 480   3]"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<version value="False"/>
			<unset unset_cli_parameters="batch, finegrain_fusing, freeze_placeholder_with_value, input, input_checkpoint, input_meta_graph, model_name, output, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_operation_patterns, tensorflow_subgraph_patterns, tensorflow_use_custom_operations_config"/>
		</cli_parameters>
	</meta_data>
</net>
